starter_viscosity_change/channel_newtonian/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1.0 0 0);

boundaryField
{
    inlet       { type cyclic; }
    outlet      { type cyclic; }
    topWall     { type fixedValue; value uniform (0 0 0); }
    bottomWall  { type fixedValue; value uniform (0 0 0); }
    frontAndBack { type empty; }
}
