starter_viscosity_change/channel_newtonian/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver      GAMG;
        tolerance   1e-10;
        relTol      0.001;
        smoother    DICGaussSeidel;
    }
    U
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-10;
        relTol      0.001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    pRefCell    0;
    pRefValue   0;

    residualControl
    {
        p       1e-8;
        U       1e-9;
    }
}

relaxationFactors
{
    fields   { p 0.9; }
    equations { U 0.9; }
}
